[
    {
        "title": "Small Cap Commodities Stock Fixes Record For Rs 5/Share Dividend, Stock Up 28.30% In 1 Month",
        "publish_time": "2023-08-28 21:56:54",
        "summary": "Small Cap Commodities Stock Fixes Record For Rs 5/Share Dividend, Stock Up 28.30% In 1 Month Investment oi-Shubham KumarSmall-cap Commodities company Tamil Nadu Newsprint & Papers Ltd. has fixed Monday, Sept 18, 2023, as the record date for a dividend of Rs 5 per share.\nCut off date for members holding shares either in physical form or in demat form.\nMonday, 18\" September, 2023 For identifying the members who are eligible to have voting rights and payment of dividend.\nMeanwhile, shares of Tamil Nadu Newspoint & Papers on Monday closed 0.99% higher at Rs 265.20 per share on the BSE.\nThe market cap of the stock is Rs 1,835.47 Crore.",
        "source": "https://www.goodreturns.in/personal-finance/investment/small-cap-commodities-stock-fixes-record-for-rs-5-share-dividend-stock-up-28-30-in-1-month-1296987.html"
    },
    {
        "title": "100% Dividend: Small Cap Healthcare Stock Fixes Record Date For 100% Payout, Stock Jumps 1.05%",
        "publish_time": "2023-08-28 21:08:16",
        "summary": "100% Dividend: Small Cap Healthcare Stock Fixes Record Date For 100% Payout, Stock Jumps 1.05% Investment oi-Shubham KumarSmall-cap Healthcare company Vijaya Diagnostic Centre Ltd. on Monday in an exchange filing announced the record date for the dividend for the financial year 2022-23.\nThe Board has fixed Wednesday, Sept 13, 2023, as the record date for Re 1 per equity share (@100%) of the face value of Re 1 each for the financial year ended March 31, 2023.\"\nAccording to an exchange filing on May 29, 2023, by the company, \"Recommendation of dividend of Re.\n1/- per equity share (@100% on a face value of Re.\nThe AGM date and record date for the purpose of the payment of dividend will be announced in due course.\"",
        "source": "https://www.goodreturns.in/personal-finance/investment/100-dividend-small-cap-healthcare-stock-fixes-record-date-for-100-payout-stock-jumps-1-05-1296975.html"
    },
    {
        "title": "Reliance AGM 2023: Analysts Expect Stock To Fall But Still Find Value",
        "publish_time": "",
        "summary": "Reliance Industries Ltd. may be undervalued even as the stock is likely to decline after the annual general meeting, according to analysts.\n\"This may be the reason behind the fall in stock prices tomorrow,\" he said.\nMayuresh Joshi, head of research at William O'Neil, said that the stock may witness a negative tick tomorrow based on the market's \"sentiment\".\nThe investors were looking forward to hearing about the strategy, plan, and business model of Jio Financial Services.\nBora advised investors to buy the stock \"on any dip\", as the company continues to grow its oil-to-chemicals business and for its long-term value creation in Jio Financial Services.",
        "source": "https://www.bqprime.com/markets/reliance-agm-2023-valuation-and-expectations-from-the-stock-according-to-analysts"
    },
    {
        "title": "Multibagger Small Cap Stock Jumps On Securing Order Worth Rs 15 Million, Launches 5 New Products",
        "publish_time": "2023-08-28 21:05:10",
        "summary": "Multibagger Small Cap Stock Jumps On Securing Order Worth Rs 15 Million, Launches 5 New Products Business oi-Shubham KumarSprayking Agro Equipment Limited, a brass manufacturer, on Monday, announces that the company has received repeat purchase order worth Rs 15 millions for the supply of Brass parts.\nFurthermore, the Company stated in the filing that it is in advance talks with Lixil Group ~ South Africa for future business order.\nOn Monday, following the order announcement Sprayking Agro Equipment shares rallied 1.04%, touched the upper circuit at Rs 202.65 on BSE.\nIts 52-week high is Rs 209.95 per share and 52-week low is Rs 13.56 per share on BSE.\nAbout - Sprayking Agro Equipment LimitedFounded in early 1980, Sprayking Agro Equipment Limited is Indutrial sector company engaged Brass Parts manufacturing, including Brass Fittings, Brass Forging Equipment, Brass Transformer Parts & other Customized Brass Parts.",
        "source": "https://www.goodreturns.in/news/multibagger-small-cap-stock-jumps-on-securing-order-worth-rs-15-million-launches-5-new-products-1296971.html"
    },
    {
        "title": "Are you a robot?",
        "publish_time": "2023-08-27 00:00:00",
        "summary": "Why did this happen?\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading.\nFor more information you can review our Terms of Service and Cookie Policy.",
        "source": "https://www.bloomberg.com/news/articles/2023-08-27/asia-stocks-set-for-small-gains-currencies-steady-markets-wrap"
    },
    {
        "title": "1 Warren Buffett Stock to Buy and Hold Forever",
        "publish_time": "2023-08-28 00:00:00",
        "summary": "He also likes to buy these businesses at reasonable prices and hold them for as long as possible, sometimes forever.\nBuffett recognized that American Express' core business was still strong and that the market had overreacted to the news.\nThe company generates revenue from four segments: U.S. consumer services, commercial services, international card services, and global merchant and network services.\nWhy American Express stock is still a worthy buy-and-holdBuffett, through Berkshire Hathaway's annual letter, has previously stated that his company essentially completed its purchases of American Express stock back in 1995.\nSo, if you're looking for a bona fide buy-and-hold play, American Express should definitely be on your radar.",
        "source": "https://www.fool.com/investing/2023/08/28/1-warren-buffett-stock-to-buy-and-hold-forever/"
    },
    {
        "title": "Heavy Buying: Multibagger auto stock hits back-to-back 52-week highs after Vijay Kedia buys 4,30,000 shares and Societe Generale bought 1,41,190 shares!",
        "publish_time": "",
        "summary": "Heavy Buying: Multibagger auto stock hits back-to-back 52-week highs after Vijay Kedia buys 4,30,000 shares and Societe Generale bought 1,41,190 shares!\nRecently the stock is hitting back-to-back 52-week highs because Societe Generale bought 141,190 shares of the company, representing a 0.5 per cent stake on August 23, 2023.\nIncluding the shares purchased by Kedia Securities, Vijay Kedia's current stake in the company is 2.93 per cent.\nThe multibagger auto stock that you are interested in is ATUL AUTO LIMITED.\nHowever, it incurred an operating loss of Rs 4.25 crore and a net loss of Rs 9.41 crore.",
        "source": "https://www.dsij.in/dsijarticledetail/heavy-buying-multibagger-auto-stock-hits-back-to-back-52-week-highs-after-vijay-kedia-buys-430000-shares-and-societe-generale-bought-141190-shares-32856-2"
    },
    {
        "title": "We are exiting one position and buying more of 4 stocks in this oversold market",
        "publish_time": "2023-08-28 00:00:00",
        "summary": "We are exiting our position in Advanced Micro Devices (AMD) Monday, selling 265 shares, at roughly $102.35 apiece.\nThis is consistent with the S & P Oscillator reading that the market is oversold (minus 5.25%) as of Friday's close.\nEstee Lauder With our purchase of Estee Lauder, we are upgrading shares back to a 1.\nJim waits 45 minutes after sending a trade alert before buying or selling a stock in his charitable trust's portfolio.\nAn Estee Lauder pop-up store is seen inside daimaru Department Store on Nanjing Road Pedestrian street in Shanghai, China, August 6, 2021.",
        "source": "https://www.cnbc.com/2023/08/28/we-are-exiting-one-position-and-buying-more-of-4-stocks-in-this-oversold-market.html"
    },
    {
        "title": "Mphasis stock falls on analyst scepticism over BFSI sector dependency",
        "publish_time": "2023-08-28 13:57:23",
        "summary": "The stock price of Mphasis tumbled on Monday, as brokerages remained largely bearish after the company’s last week hosted analyst meet that failed to convince them.\nThe stock of Mphasis closed at ₹2,325 on the NSE, down 2.81 per cent against the previous day’s close of ₹2,392.10.\nMPHL has the highest exposure in the BFS vertical compared to peers.\nMargins: ‘Range-bound’Mphasis’ margins have been range-bound, and it has not guided for margin improvement, whereas its mid-cap peers expect margins to improve over FY23-FY26.\n“Known for strength in BFSI (US, UK), Mphasis is expanding that ability to new regions (Canada, Europe, APAC) to accelerate growth.",
        "source": "https://www.thehindubusinessline.com/markets/analysts-give-thumbs-down-to-mphasis/article67245117.ece"
    },
    {
        "title": "Best Stocks to Buy: Nikola Stock vs. Plug Power Stock",
        "publish_time": "2023-08-28 00:00:00",
        "summary": "Fool.com contributor Parkev Tatevosian compares Nikola (NKLA -8.78%) and Plug Power (PLUG 1.79%) to determine the better investment for folks looking at innovative growth stocks.\n*Stock prices used were the afternoon prices of Aug. 25, 2023.\nThe video was published on Aug. 27, 2023.",
        "source": "https://www.fool.com/investing/2023/08/28/best-stocks-to-buy-nikola-stock-vs-plug-power-stoc/"
    },
    {
        "title": "Why Is Everyone Talking About Plug Power Stock?",
        "publish_time": "2023-08-28 00:00:00",
        "summary": "Parkev Tatevosian, CFA has no position in any of the stocks mentioned.\nThe Motley Fool has no position in any of the stocks mentioned.\nThe Motley Fool has a disclosure policy.\nParkev Tatevosian is an affiliate of The Motley Fool and may be compensated for promoting its services.\nHis opinions remain his own and are unaffected by The Motley Fool.",
        "source": "https://www.fool.com/investing/2023/08/28/why-is-everyone-talking-about-plug-power-stock/"
    },
    {
        "title": "Best Growth Stocks to Buy: Alphabet Stock vs. Adobe Stock",
        "publish_time": "2023-08-28 00:00:00",
        "summary": "Fool.com contributor Parkev Tatevosian evaluates Alphabet (GOOG 0.35%) (GOOGL 0.42%) and Adobe (ADBE 0.40%) across critical metrics, including valuation, to determine which is the best growth stock to buy.\n*Stock prices used were the afternoon prices of Aug. 24, 2023.\nThe video was published on Aug. 26, 2023.",
        "source": "https://www.fool.com/investing/2023/08/28/best-growth-stocks-to-buy-alphabet-stock-vs-adobe/"
    },
    {
        "title": "Stocks rise Monday as Wall Street recovers some of its steep August losses: Live updates",
        "publish_time": "2023-08-27 00:00:00",
        "summary": "Stocks rose Monday to kick off the final trading week of August, with Wall Street looking to regain ground after a month of losses.\nThe S&P 500 climbed 0.4%, and the Nasdaq Composite advanced 0.5%.\nAll three indexes have lost ground in August, with the S&P 500 shedding 3.4% while the Nasdaq and Dow slipped 4.5% and 2.6%, respectively.\nEnergy, industrial and real estate were the best-performing S&P 500 sectors.\n\"The rally to tech this year has been driven by artificial intelligence but also the quality factors within tech companies.",
        "source": "https://www.cnbc.com/2023/08/27/stock-market-today-live-updates-.html"
    },
    {
        "title": "Hot Stock: This small-cap scrip hits upper circuit on expansion spree in Gulf; gets Saudi marketing approval for Enoxaparin in PFS!",
        "publish_time": "",
        "summary": "Hot Stock: This small-cap scrip hits upper circuit on expansion spree in Gulf; gets Saudi marketing approval for Enoxaparin in PFS!\nMaking rapid global strides through an expansion into the Gulf, Venus Remedies Ltd, a prominent exporter of cost-effective generic drugs operating in over 80 countries, has attained marketing approval from Saudi Arabia.\nThe marketing approval for Enoxaparin in Saudi Arabia is anticipated to pave the way for similar authorizations in other GCC and MENA countries.\nThis anticoagulant holds significance in treating cardiovascular diseases, a notable health concern in Saudi Arabia, and is expected to contribute to the burgeoning global Enoxaparin market.\nVenus Remedies already stands as a key supplier of essential antibiotics in Saudi Arabia.",
        "source": "https://www.dsij.in/dsijarticledetail/hot-stock-this-small-cap-scrip-hits-upper-circuit-on-expansion-spree-in-gulf-gets-saudi-marketing-approval-for-enoxaparin-in-pfs-32855"
    },
    {
        "title": "Looking for Huge Passive Income? This Stock Is a Blue-Chip Bargain",
        "publish_time": "2023-08-28 00:00:00",
        "summary": "By virtue of its industry-leading $146 billion market capitalization, Philip Morris International (PM 0.86%) is certainly well known to income investors.\nPhilip Morris International's net revenue surged 14.5% higher over the year-ago period to $9 billion in the second quarter.\nTremendous quality at an undervalued valuationBecause the market mostly views Philip Morris International as an income play, climbing interest rates have diminished the appeal of the stock.\nAs the broader market has logged nice gains this year, shares of Philip Morris International have shed 6% so far in 2023.\nIf any stock deserves to be trading at a premium to its peers, Philip Morris International is probably in that company.",
        "source": "https://www.fool.com/investing/2023/08/28/huge-passive-income-stock-is-blue-chip-bargain/"
    },
    {
        "title": "This AI Stock May Be Down Lately, but I Am Holding for the Long Term",
        "publish_time": "2023-08-28 00:00:00",
        "summary": "Artificial intelligence lending company Upstart Holdings (UPST 0.10%) has stumbled since reporting its second-quarter earnings.\nThere are problems at Upstart, but I'm holding for the long term because of two significant product expansions just starting.\nAutomotive Market Data, a research survey that contained dozens of competitors, named it the fastest-growing automotive retail software last summer.\nWhile automotive loans carry risks, there is at least an asset to back the loan.\nHELOC loans carry enormous potentialMoving to increasingly secured loan categories, Upstart is just beginning to test home equity lines of credit (HELOC loans).",
        "source": "https://www.fool.com/investing/2023/08/28/this-ai-stock-may-be-down-lately-but-i-am-holding/"
    },
    {
        "title": "Apple: Not My Type Of Dividend Stock (NASDAQ:AAPL)",
        "publish_time": "2023-08-27 13:00:00",
        "summary": "That's how I feel whenever I hear someone talk about Apple (NASDAQ:AAPL) stock.\nNowadays, owning Apple products is the standard.\nApple is indeed a great stock but I'm sure my readers know I'm a dividend investor, hence the name.\nNow I know what people are going to say, Apple is not really a dividend stock, they're a growth company!\nThe stock also has the potential to keep trending upwards due to the upcoming holidays as people buy their loved ones Apple products.",
        "source": "https://seekingalpha.com/article/4631403-apple-not-my-type-of-dividend-stock"
    },
    {
        "title": "Jet Airways, Apollo Hospitals, LT Foods: Stocks to watch out for on Tuesday",
        "publish_time": "2023-08-28 18:38:08",
        "summary": "Mukesh said that Jio Platforms were keen to lead efforts in developing India-specific AI models and AI-powered solutions.\nMukesh announced that he would remain chairman and MD of RIL for the next five years.\nJio Financial ServicesThe fall in the share of Jio Financial Services was the lowest on Monday since its launch last week.\nIt came on a day when Mukesh announced that the company would enter the insurance sector.\nJet AirwaysThe NCLAT on Monday extended the time till September 30 for Jalan-Kalrock Consortium for a payment of Rs 350 crore to the lenders of the bankrupt Jet Airways.",
        "source": "https://www.zeebiz.com/markets/stocks/news-jet-airways-apollo-hospitals-lt-foods-stocks-to-watch-out-for-on-tuesday-auto-stocks-tata-motors-hero-motocorp-eicher-motors-bse-nse-250929"
    },
    {
        "title": "KPIT Technologies share price Today Live Updates : KPIT Technologies closed",
        "publish_time": "",
        "summary": "KPIT Technologies had an open price of ₹1158.95 and a close price of ₹1147 on the last day.\nThe highest price reached during the day was ₹1158.95, while the lowest price was ₹1152.85.\nThe 52-week high for the stock is ₹1200, while the 52-week low is ₹522.45.\nThe total trading volume on the BSE for the day was 302 shares.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/kpit-technologies-share-price-today-live-updates-kpit-technologies-closed-today-at-span-class-webrupee-span-115005-up-027-from-yesterday-s-span-class-webrupee-span-1147-151693194320941"
    },
    {
        "title": "Jio Financial Services share price Today Live Updates : Jio Financial Services closed today at ₹211.65, down -0.28% from yesterday's ₹212.25",
        "publish_time": "2023-08-28 11:40:00",
        "summary": "Jio Financial Services share price update :Jio Financial Services closed today at ₹211.65, down -0.28% from yesterday's ₹212.25 Today, the closing price of Jio Financial Services stock was ₹211.65, which represents a decrease of 0.28% compared to yesterday's closing price of ₹212.25.\nShare ViaJio Financial Services share price live: Stock Peers Name Latest Price Change % Change 52W High 52W Low Mkt.\nShare ViaJio Financial Services share price Live :Jio Financial Services trading at ₹211.65, down -0.28% from yesterday's ₹212.25 The current data for Jio Financial Services stock shows that the price is ₹211.65.\nShare ViaJio Financial Services share price NSE Live :Jio Financial Services trading at ₹217.45, up 2.45% from yesterday's ₹212.25 Based on the current data, the stock price of Jio Financial Services is ₹217.45.\nClick here for Jio Financial Services Dividend Share ViaJio Financial Services share price update :Jio Financial Services trading at ₹219.95, up 3.63% from yesterday's ₹212.25 The stock price of Jio Financial Services is currently ₹219.95, showing a 3.63% increase in value.",
        "source": "https://www.livemint.com/market/live-blog/jio-financial-services-share-price-live-blog-for-28-aug-2023-11693203000352.html"
    },
    {
        "title": "Indusind Bank share price Today Live Updates : Indusind Bank closed today at ₹1409.5, up 0.58% from yesterday's ₹1401.35",
        "publish_time": "2023-08-28 08:05:26",
        "summary": "Indusind Bank share price Live :Indusind Bank closed today at ₹1409.5, up 0.58% from yesterday's ₹1401.35 Indusind Bank's stock closed at ₹1409.5 today, with a percent change of 0.58 and a net change of 8.15.\nShare ViaIndusind Bank share price live: Stock Peers Name Latest Price Change % Change 52W High 52W Low Mkt.\nShare ViaIndusind Bank share price Today :Indusind Bank trading at ₹1409.5, up 0.58% from yesterday's ₹1401.35 The current data of Indusind Bank stock shows that the price is ₹1409.5.\nShare ViaIndusind Bank share price NSE Live :Indusind Bank trading at ₹1409.45, up 0.58% from yesterday's ₹1401.35 The stock price of Indusind Bank is currently ₹1409.45.\nShare ViaIndusind Bank share price update :Indusind Bank trading at ₹1402.65, up 0.09% from yesterday's ₹1401.35 The current price of Indusind Bank stock is ₹1402.65.",
        "source": "https://www.livemint.com/market/live-blog/indusind-bank-share-price-live-blog-for-28-aug-2023-11693190126966.html"
    },
    {
        "title": "Eicher Motors share price Today Live Updates : Eicher Motors closed today at ₹3348.9, up 0.22% from yesterday's ₹3341.65",
        "publish_time": "2023-08-28 08:00:14",
        "summary": "Eicher Motors share price update :Eicher Motors closed today at ₹3348.9, up 0.22% from yesterday's ₹3341.65 Today, the closing price of Eicher Motors stock was ₹3348.9, representing a percent change of 0.22 and a net change of 7.25.\nShare ViaEicher Motors share price live: Stock Peers Name Latest Price Change % Change 52W High 52W Low Mkt.\nShare ViaEicher Motors share price Today :Eicher Motors trading at ₹3356, up 0.43% from yesterday's ₹3341.65 The current data for Eicher Motors stock shows that the stock price is ₹3356.\nClick here for Eicher Motors AGM Share ViaEicher Motors share price live: Today's Price range The current day's low price for Eicher Motors stock is ₹3331.05, while the high price is ₹3364.\nShare ViaEicher Motors share price NSE Live :Eicher Motors trading at ₹3359.95, up 0.55% from yesterday's ₹3341.65 The current stock price of Eicher Motors is ₹3359.95.",
        "source": "https://www.livemint.com/market/live-blog/eicher-motors-share-price-live-blog-for-28-aug-2023-11693189814580.html"
    },
    {
        "title": "Nestle Ind share price Today Live Updates : Nestle Ind closed today at ₹22000, down -0.97% from yesterday's ₹22214.55",
        "publish_time": "2023-08-28 08:23:51",
        "summary": "Nestle Ind share price Live :Nestle Ind closed today at ₹22000, down -0.97% from yesterday's ₹22214.55 Today, the stock price of Nestle Ind closed at ₹22,000, with a decrease of -0.97%.\nShare ViaNestle India share price live: Today's Price range The low price of Nestle India stock for today is ₹21,995.45, while the high price is ₹22,188.50.\nShare ViaNestle Ind share price NSE Live :Nestle Ind trading at ₹22098.4, down -0.52% from yesterday's ₹22214.55 According to the current data, the stock price of Nestle Ind is ₹22098.4.\nShare ViaNestle Ind share price update :Nestle Ind trading at ₹22108.2, down -0.48% from yesterday's ₹22214.55 As of the current data, the stock price of Nestle Ind is ₹22108.2.\nShare ViaNestle Ind share price Today :Nestle Ind trading at ₹22138.5, down -0.34% from yesterday's ₹22214.55 The current stock price of Nestle Ind is ₹22138.5.",
        "source": "https://www.livemint.com/market/live-blog/nestle-ind-share-price-live-blog-for-28-aug-2023-11693191232228.html"
    },
    {
        "title": "Low PE multibagger stock: This micro-cap company receives order worth Rs 2.28 crore for supplies of 2 VMC machines from Heavy Vehicles Factory!",
        "publish_time": "",
        "summary": "Low PE multibagger stock: This micro-cap company receives order worth Rs 2.28 crore for supplies of 2 VMC machines from Heavy Vehicles Factory!\nThe stock gave multibagger returns of 275 per cent in just 3 years.\nThe shares of the company have a PE of 21.6x whereas the industry PE is 42.8x.\nMacpower CNC Machines Limited is engaged in the manufacture of computerized numerically controlled (CNC) machines and lathe machines.\nThe stock gave multibagger returns of 275 per cent in just 3 years.",
        "source": "https://www.dsij.in/dsijarticledetail/low-pe-multibagger-stock-this-micro-cap-company-receives-order-worth-rs-228-crore-for-supplies-of-2-vmc-machines-from-heavy-vehicles-factory-32854"
    },
    {
        "title": "Dow Jones Today: Stocks Higher to Start the Week; Dow Boosted by 3M",
        "publish_time": "",
        "summary": "U.S. stocks rose Monday morning to kick off a week full of economic data, including labor market updates and the central bank's favorite inflation measure.\nThe Dow Jones Industrial Average was up 0.5% midday, boosted by 3M (MMM), shares of which jumped after reports it would settle the largest mass tort in U.S. history.\nThis week brings updates on the U.S. labor market, including July's Job Openings and Labor Turnover Survey and ADP's National Employment Report.\nChinese stocks gained Monday after the government cut a tax on trading in another attempt to steady faltering equities.\nThe Shanghai Composite jumped 5% in early trading today, before giving up most of those gains and closing 1.1% higher.",
        "source": "https://www.investopedia.com/dow-jones-today-08282023-7853345"
    },
    {
        "title": "RailTel, Texmaco, RITES, Jupiter Wagons & select other railway stocks jump up to 15% today",
        "publish_time": "2023-08-28 00:00:00",
        "summary": "The stock eventually settled 14.70 per cent higher at Rs 190.80.\nAmong individual stocks, Texmaco Rail & Engineering Ltd soared 17.97 per cent to hit a one-year high of Rs 154.60.\nBourses BSE and NSE have put the securities of Texmaco under the long-term ASM (Additional Surveillance Measure) framework.\nRVNL, construction arm of Indian Railways, moved 2.38 per cent higher to settle at Rs 126.85.\nAlso, IRCON moved 1.51 per cent higher to finish at Rs 109.40.",
        "source": "https://www.businesstoday.in/markets/stocks/story/railtel-texmaco-rites-jupiter-wagons-select-other-railway-stocks-jump-up-to-15-today-395971-2023-08-28"
    },
    {
        "title": "Subscribe for the Best Stock Market Book In India",
        "publish_time": "",
        "summary": "Vince McmanI am reading DSIJ for last 4-5 yrs & I like all sections, but hot chips, low priced scrip are my favorites.\nPortfolio guide, technical and Databank are also outstanding.\nI can say that it is a must for novice and professional investors.\nKeep it up DSIJ.\"",
        "source": "https://www.dsij.in/products-services/for-beginners/stock-market-book"
    },
    {
        "title": "Growth concerns weighing on Nykaa's stock; it may be a blip though",
        "publish_time": "2023-08-28 18:03:52",
        "summary": "Caratlane another jewel in Titan's crown; analysts positive on prospectsDefence business to drive growth for auto component major Bharat ForgeDespite a mixed 1st quarter, cement sector's FY24 outlook looks concreteInvestors may want to bottom fish in stocks of oil marketing companiesRajesh Uppalapati as CTO, P Ganesh as CFO: Nykaa announces new appointmentsPaytm, Zomato: Analysts cautious on new-age stocks on expensive valuationsNykaa Q4 results: Net profit falls 71%, revenue from operations up 33%Five senior executives leave Nykaa; company calls it business as usualNykaa Investor Day 2023: How analysts view the e-retailer's growth plansIn the April-June quarter (Q1) of 2023-24 (FY24), growth in sales of FSN E-Commerce Ventures (the parent company of Nykaa) decelerated to 24 per cent year-on-year (Y-o-Y), and 9 perTo read the full story, subscribe to BS Premium now, at just Rs 249/ month.\nKey stories on business-standard.com are available only to BS Premium subscribers.\nRegister to read more on Business-Standard.com",
        "source": "https://www.business-standard.com/markets/stock-market-news/growth-concerns-weighing-on-nykaa-s-stock-it-may-be-a-blip-though-123082800845_1.html"
    },
    {
        "title": "3 Magnificent Growth Stocks to Buy on the Dip",
        "publish_time": "2023-08-28 00:00:00",
        "summary": "Growth stocks have lost momentum in August after a strong start to the year.\nHere's why these three beaten-down growth stocks may be worth buying on the dip.\nAn undervalued medical imaging stockNano-X Imaging is a medical imaging company that aims to revolutionize the field with its novel technology called Nanox.ARC.\nWhy is Nano-X Imaging stock a buy?\nNow, there are some important risks associated with the medical imaging specialist's novel business plan.",
        "source": "https://www.fool.com/investing/2023/08/28/3-magnificent-growth-stocks-to-buy-on-the-dip/"
    },
    {
        "title": "Power Sector Stock Under Rs 25 Locked In Upper Circuit, Hits New 52-Week High",
        "publish_time": "2023-08-28 17:51:34",
        "summary": "Power Sector Stock Under Rs 25 Locked In Upper Circuit, Hits New 52-Week High Personal Finance oi-Renu BaliyanShares of small cap company Suzlon Energy hit multiple upper circuits in last few days after the company received two back to back orders.\nSuzlon Energy stock rallied 135% in last 3-months only.\nAnand Lahoti, Founder and Chief Executive Officer, Integrum Energy Infrastructure Private Limited said, \"At Integrum Energy Infrastructure Private Limited, we are committed to shaping a sustainable and carbon neutral India.\"\nSuzlon Energy Stock Performance & Return: The last trading price of Suzlon Energy share is Rs 23.49 apiece.\nHeadquartered at Suzlon One Earth in Pune, India; the Group comprises of Suzlon Energy Limited and its subsidiaries.",
        "source": "https://www.goodreturns.in/personal-finance/power-sector-stock-under-rs-25-locked-in-upper-circuit-hits-new-52-week-high-1296925.html"
    },
    {
        "title": "Penny Stocks: Stocks likely to be in focus tomorrow!",
        "publish_time": "",
        "summary": "Penny Stocks: Stocks likely to be in focus tomorrow!\nThe following Penny Stocks are likely to be in focus on Tuesday, August 29, 2023:Manugraph India- Heavy buying was witnessed in the counter as the scrip zoomed and got locked at 20 per cent upper circuit, recording an intraday high of Rs 24.10 per share on NSE.\nManugraph India Ltd is a manufacturer of single width web-offset printing presses and provides installation and after sales services.\nDSIJ's ‘Penny Pick’ service provides research-backed penny stock recommendations below Rs.\nVikas Lifecare Ltd trades and manufactures polymer, rubber compounds and additives for plastics, synthetic & natural rubber, infra, agro products, FMCG products, etc.",
        "source": "https://www.dsij.in/dsijarticledetail/penny-stocks-stocks-likely-to-be-in-focus-tomorrow-32853"
    },
    {
        "title": "Forget Nvidia? 2 Top AI Stocks to Buy in 2023",
        "publish_time": "2023-08-28 00:00:00",
        "summary": "AlphabetUp by 48% year to date, Google's parent company, Alphabet, has performed well in 2023.\nThe company now offers its purpose-built A3 supercomputer, designed to help other companies build and train their own AI models.\nThis exposure to the pick-and-shovel side of the AI gold rush could help boost revenue and diversify Alphabet's business model.\nAdobeWith Adobe's shares up by a whopping 58% in 2023, the market has shown optimism in its potential use of AI technology to help revolutionize the creative industry.\nNow, Adobe is rolling out generative AI tools to expand its services while protecting its moat against competition.",
        "source": "https://www.fool.com/investing/2023/08/28/forget-nvidia-2-top-ai-stocks-to-buy-in-2023/"
    },
    {
        "title": "Reliance Industries share price: Stock settles lower after 46th AGM",
        "publish_time": "2023-08-28 13:13:37",
        "summary": "Following Reliance Industries' (RIL) 46th annual general meeting (AGM), the stock closed 1.27 percent lower at Rs 2,436.95 apiece on the NSE in Monday's volatile trade.\nShare Market Live NSEEarlier in the day, the stock was trading with minor gains at Rs 2,470.4 apiece on the NSE.\n\"Absence of any announcements regarding the IPOs of Reliance Retail and Telecom dragged the RIL stock down.\nForeign brokerage firm CLSA has maintained a buy rating on RIL with a target price of Rs 3,060 per share.\nCatch the latest Reliance AGM 2023 updates here",
        "source": "https://www.cnbctv18.com/market/ril-agm-2023-reliance-industries-share-price-update-mukesh-ambani-jio-ril-retail-17651561.htm"
    },
    {
        "title": "Auto stock jumps more than 15% after Kedia’s firm bought 4.3 lakh shares of the company",
        "publish_time": "2023-08-28 12:06:06",
        "summary": "Shares of this small-cap company gained 15% on Monday after Kedia Securities Pvt Ltd bought 4.3 lakh shares and the stock has reached a new 52-week high of Rs.\nA small-cap company, Atul Auto Ltd. with a market capitalisation of Rs.\nAs per the NSE Bulk Deal data, Vijay Kedia’s firm Kedia Securities Pvt Ltd bought 4.3 lakh shares at Rs.\nAccording to the latest shareholding data, Promoters hold 46.46%, DIIs hold 0.75%, FIIs hold 0.43% and the Public hold 52.36% stake in this company.\nAtul Shakti, Atul Gem, Atul Smart, Atul Gemini, Atul RIK, and Atul Elite are among the company’s product lines.",
        "source": "https://tradebrains.in/features/auto-stock-jumps-more-than-15-after-kedias-firm-bought-4-3-lakh-shares-of-the-company/"
    },
    {
        "title": "980 per cent returns in this multibagger stock: This micro-cap textile company expands its retail presence in the Southern Indian market!",
        "publish_time": "",
        "summary": "980 per cent returns in this multibagger stock: This micro-cap textile company expands its retail presence in the Southern Indian market!\nThe stock is up by 60 per cent in 1 year and gave multibagger returns of over 980 per cent returns in 3 years.\nft. area and offers the latest collection of Indian women's wear brands “Jaipur Kurti” and “Amaiva- By Jaipur Kurti”.\nJaipur Kurti is a brand that creates traditional Indian wear that is both elegant and affordable.\nThe stock is up by 60 per cent in 1 year and gave multibagger returns of over 980 per cent returns in 3 years.",
        "source": "https://www.dsij.in/dsijarticledetail/980-per-cent-returns-in-this-multibagger-stock-this-micro-cap-textile-company-expands-its-retail-presence-in-the-southern-indian-market-32852"
    },
    {
        "title": "Oil steady as China moves to bolster stock market",
        "publish_time": "2023-08-28 06:52:00",
        "summary": "Meanwhile, Tropical Storm Idalia formed Sunday in the Gulf of Mexico and was on a potential track to come ashore as a hurricane in the southern U.S., the National Hurricane Center said.\nOil rose Friday but booked back-to-back weekly declines after a string of seven straight weekly advances.\n\"Oil trading volumes show an unusual fall since July when compared to volumes traded in the past two years.\n-William WattsThis content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.\n(END) Dow Jones Newswires08-28-23 0752ETCopyright (c) 2023 Dow Jones & Company, Inc.",
        "source": "https://www.morningstar.com/news/marketwatch/2023082872/oil-steady-as-china-moves-to-bolster-stock-market"
    },
    {
        "title": "Stocks making the biggest moves premarket: 3M, CrowdStrike, Xpeng and more",
        "publish_time": "2023-08-28 00:00:00",
        "summary": "Xpeng — U.S.-traded shares of the Chinese electric vehicle company jumped 5% Monday premarket.\nXpeng announced it would buy Didi's smart electric car business in a deal worth $744 million.\nMister Car Wash — The car wash stock climbed 5.7% in premarket trading following an upgrade to overweight from neutral by Piper Sandler.\nThe firm said Mister Car Wash has upside potential over the next two years.\nCrowdStrike — Shares of the cybersecurity company fell 2.6% in premarket trading after Morgan Stanley downgraded CrowdStrike to equal weight from overweight.",
        "source": "https://www.cnbc.com/2023/08/28/stocks-making-the-biggest-moves-premarket-3m-crowdstrike-xpeng-and-more.html"
    },
    {
        "title": "Stock Market Today: Sensex, Nifty Rebound After Two-Day Fall As HDFC Bank, L&T Gain; FPIs Stay Net Sellers",
        "publish_time": "",
        "summary": "India's benchmark stock indices advanced after a volatile open on Monday as realty, pharmaceutical and PSU banking sectors rose, while fast moving consumer goods and I.T.\nThe indices snapped two days of losses as Sensex rebound to the 65,000 level, while Nifty was trading beyond 19,300 mark.\nThe S&P BSE Sensex closed up 110 points, or 0.17%, at 64,996.60, while the NSE Nifty 50 was 40 points, or 0.21%, higher at 19,306.05.\nEuropean stocks started the week on a positive note, tracking Friday’s gains on Wall Street following cautious comments from central bankers at Jackson Hole.\nThe rate-sensitive technology sector led the advance in Europe after Federal Reserve Chair Jerome Powell and European Central Bank President Christine Lagarde at Jackson Hole on Friday failed to shake the outlook for interest rates.",
        "source": "https://www.bqprime.com/markets/stock-market-live-updates-28-august-2023-gift-nifty-signals-higher-open-lt-bel-beml-linde-india-indostar-finance-in-focus"
    },
    {
        "title": "Tata Group Stock Falls For Fifth Straight Session, Down 3% In 1-Week",
        "publish_time": "2023-08-28 17:09:48",
        "summary": "Tata Group Stock Falls For Fifth Straight Session, Down 3% In 1-Week News oi-Renu BaliyanShares of large cap Tata Group stock from auto sector, Tata Motors Ltd witnessed a decline of 0.54% intraday on BSE.\nTata Motors Stock Performance & Return: Last trading price of Tata Motors share is Rs 602.20 apiece.\nTata Motors shares declined for fifth straight session today.\nTata Motors About: Tata Motors Limited, a USD 35 billion organisation, is a leading automobile manufacturer with a portfolio that includes a wide range of cars, utility vehicles, trucks, buses and defence vehicles.\nPart of the USD128 billion Tata group founded by Jamsetji Tata in 1868, Tata Motors is among the world's leading manufacturers of automobiles, according to its official website.",
        "source": "https://www.goodreturns.in/news/tata-group-stock-falls-for-fifth-straight-session-down-3-in-1-week-1296909.html"
    },
    {
        "title": "2023 Stock Report: College football preseason narratives I'm buying this fall",
        "publish_time": "2023-08-28 11:38:36",
        "summary": "Each Monday, I’ll both look back at the week that was and project forward to the weeks to come with a Stock Report.\nBut with preseason narratives running wild, we’re going to do a little Buy or Sell: Stock Report on some 2023 preseason takes — some popular and others a bit off the grid.\nIn a two-part series today, we start with narrative stocks I’m buying in college football this fall…I’m buying … the 2023 season will be specialMost every college football fan fell in love with the sport because of the actual games.\nWeek 0’s amuse-bouche was tasty, but this week — with games Thursday-Monday night — we’re blessed with the full 12-course meal to kickoff what should be a very special 2023 season.\n— but I’m all-in on Texas’ second-year quarterback making a leap into (or near) Tier 1 status in 2023.",
        "source": "https://www.on3.com//news/2023-stock-report-college-football-preseason-narratives-im-buying-this-fall/"
    },
    {
        "title": "Tech Mahindra share price Today Live Updates : Tech Mahindra closed today at ₹1184.55, down -0.42% from yesterday's ₹1189.5",
        "publish_time": "2023-08-28 08:25:59",
        "summary": "Tech Mahindra share price Live :Tech Mahindra closed today at ₹1184.55, down -0.42% from yesterday's ₹1189.5 Tech Mahindra's stock closed at ₹1184.55 today, showing a decrease of 0.42% or a net change of -4.95.\nShare ViaTech Mahindra share price live: Stock Peers Name Latest Price Change % Change 52W High 52W Low Mkt.\nShare ViaTech Mahindra share price Today :Tech Mahindra trading at ₹1184.55, down -0.42% from yesterday's ₹1189.5 As of the current data, the stock price of Tech Mahindra is ₹1184.55.\nShare ViaTech Mahindra share price Today :Tech Mahindra trading at ₹1184.65, down -0.41% from yesterday's ₹1189.5 As of the current data, the stock price of Tech Mahindra is ₹1184.65.\nShare ViaTech Mahindra share price live: Today's Price range Tech Mahindra stock's low price for the day was ₹1181.05, while the high price reached was ₹1195.8.",
        "source": "https://www.livemint.com/market/live-blog/tech-mahindra-share-price-live-blog-for-28-aug-2023-11693191359499.html"
    },
    {
        "title": "5 things to know before the stock market opens Monday",
        "publish_time": "2023-08-28 00:00:00",
        "summary": "This week, investors will be looking ahead to more economic data that could give an indication of the Fed's next move, with the monthly jobs report set to be released on Friday.\nAn answer finally came Friday, when grocery delivery startup Instacart and data and marketing automation company Klaviyo filed for stock market debuts.\nNot so grandThe Evergrande Group headquarters building in Shenzhen is pictured on January 11, 2022 in Shenzhen, Guangdong Province of China.\nLiang Xiashun | Visual China Group | Getty ImagesShares of China Evergrande Group, the world's most indebted property developer, plunged Monday, as it traded for the first time since March 21, 2022.\nThe beleaguered company filed for Chapter 15 bankruptcy in the United States in July, which will protect its U.S. assets from creditors while it works out a restructuring deal.",
        "source": "https://www.cnbc.com/2023/08/28/5-things-to-know-before-the-stock-market-opens-monday-august-28.html"
    },
    {
        "title": "RIL shares settle lower after 46th AGM. Here's why",
        "publish_time": "2023-08-28 00:00:00",
        "summary": "Shares of Reliance Industries Ltd (RIL) settled lower on Monday, making it the fourth straight time when the RIL stock declined on the day of annual general meeting.\nReliance Industries settle the day at Rs 2,442.55 on BSE, down 1.11 per cent.\nWhile Reliance Industries made a host of announcements this time, Street was disappointed as the AGM speech did not gave any specific roadmap on the listing of Reliance Retail and Reliance Jio.\nAt its AGM, Ambani formalised his succession plan at the conglomerate.\nHe said that like Reliance Retail and Reliance Jio, he is confident that Jio Financial Services will prove to be an invaluable addition to Reliance Industries’ ecosystem of consumer-facing businesses.",
        "source": "https://www.businesstoday.in/markets/company-stock/story/ril-shares-settle-lower-after-46th-agm-heres-why-395953-2023-08-28"
    },
    {
        "title": "Rs 105/Share Dividend: Large Cap FMCG Stock Recommends Final Dividend, Scrip Jumps 6.47%",
        "publish_time": "2023-08-28 16:41:27",
        "summary": "Rs 105/Share Dividend: Large Cap FMCG Stock Recommends Final Dividend, Scrip Jumps 6.47% Investment oi-Shubham KumarProcter & Gamble Hygiene and Health Care Ltd., a large-cap FMCG company, on Monday recommended a final dividend of Rs 105 per equity share.\n\"the Board of Directors of the Company at its meeting held today, inter alia, have recommended a final dividend of Rs.\nShares of P&G Hygiene and Health Care on Monday closed at Rs 16,495 per share, up 6.47% from the previous close.\nThe stock hit intraday highs and lows of Rs 16,599 and Rs 15,444.80 on the BSE, respectively.\nThe stock's 52-week high is Rs 16,599 per share and 52-week low is Rs 13,101.05 per share.",
        "source": "https://www.goodreturns.in/personal-finance/investment/rs-105-share-dividend-large-cap-fmcg-stock-recommends-final-dividend-scrip-jumps-6-47-1296901.html"
    },
    {
        "title": "Shares below Rs 100: Only buyers were seen in these stocks on August 28",
        "publish_time": "",
        "summary": "Shares below Rs 100: Only buyers were seen in these stocks on August 28About 2,066 shares have advanced, 1,676 declined and 165 are unchanged on BSE.\nThe company is a 50 per cent partner in the JV valued at Rs 3,637.12 crore and out of Patel Engineering’s share in the project is Rs.\nGraviss Hospitality Ltd.’s shares were locked in 20 per cent upper circuit to Rs 38.90 per share with a spurt in volume by more than 7.37 times on BSE.\nIn FY23, the net sales increased by 83.25 per cent to Rs 52.72 crore and net profit increased by 467 per cent to Rs 7.27 crore compared to FY22.\nJaiprakash Associates Ltd.’s shares saw heavy buying and hit a 10 per cent upper circuit to Rs 10.99 per share with a spurt in volume by more than 6.38 times on BSE.",
        "source": "https://www.dsij.in/dsijarticledetail/shares-below-rs-100-only-buyers-were-seen-in-these-stocks-on-august-28-32851-1"
    },
    {
        "title": "Stock jumps more than 9% after receiving a project with the potential to generate ₹ 4000 Cr revenue",
        "publish_time": "2023-08-28 11:06:29",
        "summary": "This small-cap stock gained 9.45% on Monday after announcing a 4,000 Cr revenue-generating project.\nThe stock price is being supported by a significant volume increase that was higher than the prior day and the previous week.\nCurrently, shares of this company are trading above the 50-day and 200-day moving averages.\nAs per the latest shareholding data, Promoters hold 67.12%, DIIs hold 1.67%, FIIs hold 2.39% and the Public hold a 28.82% stake in this company.\nIt undertakes the following projects, which include port infrastructure, commercial and institutional construction, road construction, residential construction and industrial construction.",
        "source": "https://tradebrains.in/features/stock-jumps-more-than-9-after-receiving-a-project-with-the-potential-to-generate-4000-cr-revenue/"
    },
    {
        "title": "News Services Division: Breaking News Today, Top Headlines, Live Updates, Top Stories",
        "publish_time": "",
        "summary": "Union Minister Darshana Jardosh inaugurates Nagaland Women Vocational Training Institute Emporium located in KohimaMaharashtra Housing and Area Development Authority introduces e-billing system for online paymentMaharashtra becomes second-highest State that possesses largest number of minor irrigation schemes after UPRozgar Mela: Union Minister John Barla distributes 85 appointment letters to candidates in AizawlPM Modi congratulates Jan Dhan Yojana beneficiaries on completion of nine years of the schemeUK Air traffic issue fixed but significant flight backlog remains: NATSUS Open Tennis kicks off in New YorkNCERT includes chapter on National War Memorial in Class 7 English textbookMaharashtra Govt signs MoU with Germany's professional association football league to help young players",
        "source": "https://newsonair.gov.in/News%3Ftitle%3DAsian-benchmarks-rise-after-Beijing-reduce-levy-charged-on-stock-trades%26id%3D466843"
    },
    {
        "title": "Could PayPal's New CEO Send the Stock Skyrocketing?",
        "publish_time": "2023-08-28 00:00:00",
        "summary": "However, recent news of PayPal's new CEO could get investors excited as his background fits nicely into PayPal's best business segment.\nChriss was formerly the executive vice president of Intuit's small business and self-employed group, which is its largest division by revenue.\nAlthough PayPal hasn't updated this graph since Q4 2022 results, it has continuously noted that significant business growth has come from its Braintree product.\nChriss knows small businesses well, and I'd expect significant growth of Paypal's Braintree product to continue under his leadership.\nDespite these rosy projections, PayPal's stock trades at a dirt-cheap valuation level.",
        "source": "https://www.fool.com/investing/2023/08/28/could-paypals-new-ceo-send-the-stock-skyrocketing/"
    },
    {
        "title": "RIL shares slump to 1-month low; why Ambani failed to cheer shareholders?",
        "publish_time": "",
        "summary": "MUMBAI: Wiping out the day’s gains, shares of Reliance Industries plunged to their lowest level in a month, as Chairman Mukesh Ambani ’s address to the shareholders at the annual general meeting lacked any surprise element for Dalal Street.The stock ended 1% down at Rs 2,443.75 on the National Stock Exchange, after hitting a 1-month low of 2,431.10 intraday.This is the third consecutive time Ambani has disappointed investors by making no big-bang announcements.In the last two years, shares of RIL have ended in the red on the day of the AGM address.“The company’s stock experienced a decline due to the absence of clear timelines regarding the telecom and retail IPOs,” said Santosh Meena, Head of Research, Swastika Investmart.Following the announcement of a 1% stake sale in subsidiary Reliance Retail Ventures to Qatar Investment Authority, Dalal Street was abuzz with talks that Ambani might throw some colour on a potential initial public offering of the subsidiary.However, there wasn’t any mention about it in the Ambani speech.“Several marquee global strategic and financial investors have shown strong interest in Reliance Retail.\nI will update you about our progress with them in due course,” Ambani said.The market was also expecting finer details on the Jio Financial business strategy and expansion plans.\nAmbani said that Jio Financial will massively increase financial services penetration through a digital-first approach, and will also enter into the growing insurance sector.Besides this, the launch of JioAirFiber on September 19, and a possible succession plan through induction of Akash, Isha, and Anant Ambani as directors on RIL board were the other announcements done by Mukesh Ambani at the AGM.However, these announcements failed to change investors’ mood, who resorted to selling the stock.\n(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own.\nThese do not represent the views of Economic Times)",
        "source": "https://m.economictimes.com/markets/stocks/news/ril-shares-slump-to-1-month-low-why-did-dalal-street-investors-punish-ambani/articleshow/103137210.cms"
    },
    {
        "title": "Nvidia stock surge faces not-so-subtle risk from China",
        "publish_time": "",
        "summary": "Lost in the enthusiasm for Nvidia's big quarter and outlook was a clear warning about China from the company's top execs.\nChina represents a significant chunk of Nvidia's data center business: 20% to 25%, depending on the quarter.\nNvidia stock is not currently priced for the risk of a huge portion of business drying up, trading on a forward price-to-earnings multiple of 61.\nBut remember, Apple has a big business in China.\nStarbucks has a big business in China.",
        "source": "https://finance.yahoo.com/news/nvidia-stock-surge-faces-not-so-subtle-risk-from-china-100057351.html"
    },
    {
        "title": "Share Market Highlights 28 August 2023: Benchmark indices rebound; Sensex surges 110 pts, Nifty ends above 19,300",
        "publish_time": "2023-08-28 01:39:57",
        "summary": "August 28, 2023 16:26​Equity benchmark indices climbed on Monday after two days of fall​, tracking strength in global markets and buying in HDFC Bank.\nThe BSE ​Sensex​ climbed 110.09 points or 0.17 per cent to settle at 64,996.60.\nThe NSE ​Nifty​ gained 40.25 points or 0.21 per cent to end at 19,306.05.\nFrom the Sensex pack, Larsen & Toubro, Mahindra & Mahindra, HDFC Bank, Sun Pharma, Maruti, Kotak Mahindra Bank, IndusInd Bank, Tata Steel and State Bank of India were among the gainers.\nReliance Industries, Nestle, Titan, HCL Technologies, ITC and Tata Motors were among the laggards.",
        "source": "https://www.thehindubusinessline.com/markets/share-market-highlights-28-august-2023/article67241681.ece"
    },
    {
        "title": "Possible Bearish Signals With AGNC Investment Insiders Disposing Stock",
        "publish_time": "",
        "summary": "However, shareholders should take a deeper look if several insiders are selling stock over a specific time period.\nIn total, AGNC Investment insiders sold more than they bought over the last year.\nSo What Do The AGNC Investment Insider Transactions Indicate?\nWe don't take much encouragement from the transactions by AGNC Investment insiders.\nBut note: AGNC Investment may not be the best stock to buy.",
        "source": "https://simplywall.st/stocks/us/diversified-financials/nasdaq-agnc/agnc-investment/news/possible-bearish-signals-with-agnc-investment-insiders-dispo"
    },
    {
        "title": "Bank of America Corporation (NYSE:BAC) Looks Like A Good Stock, And It's Going Ex-Dividend Soon",
        "publish_time": "",
        "summary": "Bank of America Corporation ( ) is about to trade ex-dividend in the next 2 days.\nCalculating the last year's worth of payments shows that Bank of America has a trailing yield of 3.4% on the current share price of $28.5.\nBank of America paid out a comfortable 25% of its profit last year.\nSince the start of our data, 10 years ago, Bank of America has lifted its dividend by approximately 37% a year on average.\nIn light of that, while Bank of America has an appealing dividend, it's worth knowing the risks involved with this stock.",
        "source": "https://simplywall.st/stocks/us/banks/nyse-bac/bank-of-america/news/bank-of-america-corporation-nysebac-looks-like-a-good-stock"
    },
    {
        "title": "Kalpataru Projects International share price Today Live Updates : Kalpataru",
        "publish_time": "",
        "summary": "The last day of trading for Kalpataru Projects International saw the stock open at ₹622.15 and close at ₹624.55.\nThe stock's high for the day was ₹624.55, while the low was ₹622.15.\nThe 52-week high for the stock is ₹654.50, while the 52-week low is ₹353.35.\nThe BSE volume for the stock on this day was 56 shares.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/kalpataru-projects-international-share-price-today-live-updates-kalpataru-projects-international-surges-in-trading-today-151693194412281"
    },
    {
        "title": "Sensex, Nifty end flat; RIL, Jio Fin drop 1% as 46th AGM lacks fireworks",
        "publish_time": "2023-08-28 07:23:13",
        "summary": "Stock market highlights: Mukesh Ambani-led Reliance Industries' 46th Annual General Meeting (AGM) has concluded where the chairman put forth his plans for Reliance Retail, Jio Financial Services, and Reliance Jio.\nAt the bourses, shares of the company ended as the top large-cap laggards amid profit booking.\nWhile shares of RIL slipped 1.4 per cent, those of Jio Financial Services fell 0.97 per cent.\n...Read More",
        "source": "https://www.business-standard.com/markets/news/stock-market-live-august-28-sensex-nifty-reliance-agm-jerome-powell-dalal-street-123082800076_1.html"
    },
    {
        "title": "Archean Chemical Industries share price Today Live Updates : Archean Chemical",
        "publish_time": "",
        "summary": "On the last day of trading, Archean Chemical Industries opened at ₹600.15 and closed at ₹594.8.\nThe stock's high for the day was ₹604.95, while the low was ₹600.15.\nOver the past 52 weeks, the stock has reached a high of ₹731.75 and a low of ₹440.05.\nThe BSE volume for the day was 1195 shares.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/archean-chemical-industries-share-price-today-live-updates-archean-chemical-industries-stock-surges-on-positive-trading-day-151693194604117"
    },
    {
        "title": "Dalmia Bharat share price Today Live Updates : Dalmia Bharat closed today",
        "publish_time": "",
        "summary": "On the last day, Dalmia Bharat's stock opened at ₹2009.65 and closed at ₹1995.7.\nThe stock reached a high of ₹2010 and a low of ₹1975.1.\nThe 52-week high for the stock is ₹2289.45 and the 52-week low is ₹1478.05.\nThe stock had a trading volume of 2238 shares on the BSE.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/dalmia-bharat-share-price-today-live-updates-dalmia-bharat-stock-surges-in-trading-today-151693192904265"
    },
    {
        "title": "Au Small Finance Bank share price Today Live Updates : Au Small Finance",
        "publish_time": "",
        "summary": "On the last day of August, Au Small Finance Bank had an open price of ₹738 and a close price of ₹745.35.\nThe stock reached a high of ₹751.85 and a low of ₹734.6 during the day.\nThe 52-week high for the stock is ₹794.95 and the 52-week low is ₹548.15.\nThe BSE volume for the day was 41,834 shares.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/au-small-finance-bank-share-price-today-live-updates-au-small-finance-bank-stock-rises-on-positive-market-sentiment-151693190988674"
    },
    {
        "title": "Karur Vysya Bank share price Today Live Updates : Karur Vysya Bank's Stocks",
        "publish_time": "",
        "summary": "The last day of Karur Vysya Bank saw an open price of ₹121.05 and a close price of ₹120.65.\nThe highest price during the day was ₹122.1 and the lowest was ₹121.05.\nThe 52-week high for the bank's shares was ₹137.7 and the 52-week low was ₹62.2.\nThe BSE volume for the day was 1325 shares.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/karur-vysya-bank-share-price-today-live-updates-karur-vysya-bank-s-stocks-plummet-in-trading-today-151693194387295"
    },
    {
        "title": "Abbott India share price Today Live Updates : Abbott India sees stock rise",
        "publish_time": "",
        "summary": "Abbott India's stock opened at ₹23150 and closed at ₹23155 on the last trading day.\nThe highest price reached during the day was ₹23228.8, while the lowest price was ₹23035.5.\nThe market capitalization of Abbott India is ₹49170.88 crore.\nThe stock's 52-week high is ₹24724.95, and its 52-week low is ₹17242.35.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/abbott-india-share-price-today-live-updates-abbott-india-sees-stock-rise-in-positive-trading-day-151693190521718"
    },
    {
        "title": "Bank Of Baroda share price Today Live Updates : Bank of Baroda Stock Sees",
        "publish_time": "",
        "summary": "On the last day of trading, Bank of Baroda (BOB) opened at ₹191 and closed at ₹191.85.\nThe stock reached a high of ₹191.8 and a low of ₹188.75 during the day.\nThe 52-week high for the stock is ₹210.8, while the 52-week low is ₹116.3.\nThe stock had a trading volume of 573,496 shares on the Bombay Stock Exchange (BSE).\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/bank-of-baroda-share-price-today-live-updates-bank-of-baroda-stock-sees-positive-trading-day-151693192623744"
    },
    {
        "title": "KEI Industries share price Today Live Updates : KEI Industries Stocks Decline",
        "publish_time": "",
        "summary": "KEI Industries had a relatively stable day on the stock market, with the open and close prices both at ₹2618.45.\nThe stock reached a high of ₹2624.6 and a low of ₹2555.6.\nOver the past year, the stock has reached a high of ₹2812.2 and a low of ₹1350.7.\nThe BSE volume for the day was 13,942 shares.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/kei-industries-share-price-today-live-updates-kei-industries-stocks-decline-on-market-151693192125986"
    },
    {
        "title": "Go Fashion (India) share price Today Live Updates : Go Fashion (India)",
        "publish_time": "",
        "summary": "On the last day of trading, Go Fashion (India) opened at ₹1248.35 and closed at ₹1252.45.\nThe stock had a high of ₹1291.35 and a low of ₹1245.5 during the day.\nThe 52-week high for the stock is ₹1450, while the 52-week low is ₹876.15.\nThe BSE volume for the stock was 3309 shares.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/go-fashion-india-share-price-today-live-updates-go-fashion-india-faces-stock-decline-151693190147512"
    },
    {
        "title": "Birla Corporation share price Today Live Updates : Birla Corporation Stocks",
        "publish_time": "",
        "summary": "On the last day, Birla Corporation's stock opened at ₹1141.9 and closed at ₹1142.15.\nThe stock reached a high of ₹1155.6 and a low of ₹1127.6 during the day.\nThe stock's 52-week high is ₹1266 and the 52-week low is ₹843.05.\nThe BSE volume for the stock on the last day was 3628 shares.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/birla-corporation-share-price-today-live-updates-birla-corporation-stocks-plummet-in-trading-today-151693193192673"
    },
    {
        "title": "Indiabulls Real Estate share price Today Live Updates : Indiabulls Real",
        "publish_time": "",
        "summary": "Indiabulls Real Estate, a real estate development company, had an open price of ₹72.06 and a close price of ₹71.56 on the last day.\nThe stock reached a high of ₹74.19 and a low of ₹72 during the day.\nThe 52-week high and low for the stock are ₹94.7 and ₹45.94 respectively.\nOn the BSE, a total of 606,168 shares were traded.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/indiabulls-real-estate-share-price-today-live-updates-indiabulls-real-estate-stock-on-the-rise-151693194921300"
    },
    {
        "title": "Capri Global Capital share price Today Live Updates : Capri Global Capital",
        "publish_time": "",
        "summary": "Capri Global Capital's stock opened at ₹790 and closed at ₹789.95 on the last day.\nThe stock reached a high of ₹799.95 and a low of ₹787.5 during the day.\nThe 52-week high of the stock is ₹874 and the 52-week low is ₹565.85.\nThe BSE volume for the day was 51,351 shares.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/capri-global-capital-share-price-today-live-updates-capri-global-capital-sees-stock-rise-today-151693192223829"
    },
    {
        "title": "IFB Industries share price Today Live Updates : IFB Industries Stocks Plunge",
        "publish_time": "",
        "summary": "On the last trading day, IFB Industries opened at ₹935.7 and closed at ₹937.\nThe stock had a high of ₹947.1 and a low of ₹918.1.\nThe 52-week high for the stock is ₹1,166 and the 52-week low is ₹698.\nThe BSE volume for the stock on that day was 7,457 shares.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/ifb-industries-share-price-today-live-updates-ifb-industries-stocks-plunge-in-today-s-trading-151693190684783"
    },
    {
        "title": "Alembic Pharmaceuticals share price Today Live Updates : Alembic Pharmaceuticals",
        "publish_time": "",
        "summary": "Alembic Pharmaceuticals opened at ₹741.65 and closed at ₹752.9 on the last day.\nThe highest price reached during the day was ₹754.15, while the lowest price was ₹741.65.\nThe market capitalization of Alembic Pharmaceuticals is ₹14,812.01 crore.\nThe 52-week high for the stock is ₹797.95, and the 52-week low is ₹463.3.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/alembic-pharmaceuticals-share-price-today-live-updates-alembic-pharmaceuticals-stock-gains-momentum-151693194343133"
    },
    {
        "title": "Easy Trip Planners share price Today Live Updates : Easy Trip Planners",
        "publish_time": "",
        "summary": "Easy Trip Planners saw a decrease in its stock price on the last trading day.\nThe highest price for the day was ₹40.5, while the lowest price was ₹40.25.\nThe 52-week high for the stock is ₹73.5, and the 52-week low is ₹37.11.\nThe BSE volume for the day was 19,895 shares.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/easy-trip-planners-share-price-today-live-updates-easy-trip-planners-struggles-with-negative-trading-151693194420512"
    },
    {
        "title": "Blue Dart Express share price Today Live Updates : Blue Dart Express closed",
        "publish_time": "",
        "summary": "On the last day of trading, Blue Dart Express had an opening price of ₹6335.2 and a closing price of ₹6473.4.\nThe stock reached a high of ₹6515.75 and a low of ₹6335.2.\nThe 52-week high for the stock is ₹9639.45 and the 52-week low is ₹5633.\nThe BSE volume for the stock was 226 shares.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/blue-dart-express-share-price-today-live-updates-blue-dart-express-stock-drops-on-poor-trading-day-151693192727959"
    },
    {
        "title": "Godrej Agrovet share price Today Live Updates : Godrej Agrovet stock plummets",
        "publish_time": "",
        "summary": "On the last day, Godrej Agrovet opened at ₹485.55 and closed at ₹484.15.\nThe stock reached a high of ₹487.55 and a low of ₹484.7.\nThe 52-week high for the stock is ₹560 and the 52-week low is ₹391.2.\nThe trading volume on the BSE was 17 shares.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/godrej-agrovet-share-price-today-live-updates-godrej-agrovet-stock-plummets-in-trading-today-151693194779990"
    },
    {
        "title": "Grindwell Norton share price Today Live Updates : Grindwell Norton closed",
        "publish_time": "",
        "summary": "Grindwell Norton's stock opened at ₹2274.4 and closed at ₹2270.75 on the last day.\nThe stock had a high of ₹2291.85 and a low of ₹2229.3.\nThe 52-week high of the stock is ₹2494.55 and the 52-week low is ₹1717.5.\nOn the BSE, the stock had a volume of 1415 shares.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/grindwell-norton-share-price-today-live-updates-grindwell-norton-stock-plummets-as-trading-takes-a-hit-151693193785139"
    },
    {
        "title": "Aia Engineering share price Today Live Updates : Aia Engineering closed",
        "publish_time": "",
        "summary": "On the last day of trading, Aia Engineering's stock opened at ₹3668.45 and closed at ₹3642.1.\nThe stock had a high of ₹3710.75 and a low of ₹3666.05.\nThe 52-week high for the stock is ₹3700 and the 52-week low is ₹2385.\nThe BSE volume for the stock on that day was 118 shares.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/aia-engineering-share-price-today-live-updates-aia-engineering-sees-positive-trading-day-151693194682371"
    },
    {
        "title": "JK Cement Shareholders Reject 277% Increase to Corporate Transaction Limit; Stock Closes in Red",
        "publish_time": "2023-08-28 10:34:20",
        "summary": "As per the scrutinizer’s stock exchange report filed by JK Lakshmi Cement Ltd (“JKLC”),shareholders of JKLC have rejected a special resolution for increasing inter corporate transaction limit to Rs 10,000 crore.\nAs per section 186 of Companies’ Act 2013, the mandate is to require a supermajority to pass the special resolution i.e, 75%.\nThe proposal was to increase the limit from current Rs.\nJKLC is a part of JK Organisation group and its revenue was at Rs 6,071.05 crore in FY2023.\nThe company however has received upside price targets from several brokers, including Motilal Oswal that has set Rs.",
        "source": "https://tradebrains.in/features/jk-cement-shareholders-reject-277-increase-to-corporate-transaction-limit-stock-closes-in-red/"
    },
    {
        "title": "Apar Industries share price Today Live Updates : Apar Industries closed",
        "publish_time": "",
        "summary": "Apar Industries' stock price remained unchanged at ₹4894.6 on the last day of trading.\nThe stock had a high of ₹5047 and a low of ₹4872.85 during the day.\nThe 52-week high and low for the stock are ₹5353.2 and ₹1172.8 respectively.\nThe stock had a trading volume of 4824 shares on the Bombay Stock Exchange (BSE).\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/apar-industries-share-price-today-live-updates-apar-industries-stocks-soar-in-trading-today-151693190270987"
    },
    {
        "title": "Colgate Palmolive India share price Today Live Updates : Colgate Palmolive",
        "publish_time": "",
        "summary": "On the last day, the open price of Colgate Palmolive India was ₹1978, while the close price was ₹1974.3.\nThe stock had a high of ₹2001 and a low of ₹1966.2.\nThe 52-week high and low for the stock are ₹2061.55 and ₹1434.6 respectively.\nThe volume of shares traded on the BSE was 17,500.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/colgate-palmolive-india-share-price-today-live-updates-colgate-palmolive-india-stocks-plummet-in-trading-session-151693193837254"
    },
    {
        "title": "Lessons for next time after Nvidia’s stock didn’t surge, and options tanked, following blowout earnings",
        "publish_time": "",
        "summary": "According to FactSet, Nvidia’s earnings beat Wall Street estimates by 29.7% — a larger beat that the 18% beat last quarter, when the market awoke to the potential of artificial intelligence plays to make money right now.\nIf that person bought right before Nvidia announced results, the investor was down slightly more than 2% by the end of the week.\nThe at-the-money calls quickly turned negative and by the end of the first trading day after Nvidia’s results had lost nearly half their value.\nOne could have, of course, just shorted the stock, or the options on either Nvidia or its volatility.\nTroubled utility Hawaiian Electric Industries HE, +43.69% saw its stock rise in premarket trade, after it tumbled 19% on Friday.",
        "source": "https://www.marketwatch.com/story/lessons-for-next-time-after-nvidias-stock-didnt-surge-and-options-tanked-following-blowout-earnings-f0167d80"
    },
    {
        "title": "Craftsman Automation share price Today Live Updates : Craftsman Automation",
        "publish_time": "",
        "summary": "On the last day of trading, Craftsman Automation opened at ₹4975.75 and closed at ₹4949.35.\nThe stock had a high of ₹4979.65 and a low of ₹4840.05.\nThe 52-week high for the stock is ₹5020.25 and the 52-week low is ₹2464.\nThere were 299 shares traded on the BSE.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/craftsman-automation-share-price-today-live-updates-craftsman-automation-s-stock-plummets-in-trading-today-151693190588452"
    },
    {
        "title": "Happiest Minds Technologies share price Today Live Updates : Happiest Minds",
        "publish_time": "",
        "summary": "Happiest Minds Technologies opened at ₹911.75 and closed at ₹917.3 on the last day.\nThe high price for the day was ₹917.8 and the low price was ₹902.75.\nThe 52-week high for the stock is ₹1091.3 and the 52-week low is ₹763.5.\nThe BSE volume for the day was 36,282 shares.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/happiest-minds-technologies-share-price-today-live-updates-happiest-minds-technologies-stock-declines-in-trading-today-151693190263969"
    },
    {
        "title": "IPCA Laboratories share price Today Live Updates : IPCA Laboratories' stock",
        "publish_time": "",
        "summary": "On the last day of trading, IPCA Laboratories opened at ₹877.25 and closed at ₹883.50.\nThe stock reached a high of ₹901.70 and a low of ₹876.55 during the day.\nThe market capitalization of IPCA Laboratories is ₹22,395.74 crores.\nThe 52-week high for the stock is ₹950 and the 52-week low is ₹670.\nThe BSE volume for IPCA Laboratories was 29,232 shares.",
        "source": "https://mintgenie.livemint.com/news/markets/ipca-laboratories-share-price-today-live-updates-ipca-laboratories-stock-on-the-rise-today-151693192527525"
    },
    {
        "title": "Campus Activewear share price Today Live Updates : Campus Activewear Stocks",
        "publish_time": "",
        "summary": "On the last day, the open price for Campus Activewear was ₹295, and the close price was ₹294.55.\nThe stock had a high of ₹306.5 and a low of ₹294.95.\nThe market capitalization of Campus Activewear is ₹9,303.75 crore.\nThe 52-week high for the stock is ₹640, while the 52-week low is ₹282.45.\nDisclaimer: This is an AI-generated live blog and has not been edited by MintGenie staff.",
        "source": "https://mintgenie.livemint.com/news/markets/campus-activewear-share-price-today-live-updates-campus-activewear-stocks-plummet-151693191642143"
    },
    {
        "title": "Google Help",
        "publish_time": "",
        "summary": "If you're having trouble accessing a Google product, there's a chance we're currently experiencing a temporary problem.\nYou can check for outages and downtime on the G Suite Status Dashboard",
        "source": "https://support.google.com/websearch%3Fp%3Dws_settings_location%26hl%3Den-IN"
    }
]