[
    {
        "title": "Wriggling worm found in woman’s brain",
        "publish_time": "2023-08-29 00:00:00",
        "summary": "A woman has had an 8cm-long parasitic roundworm removed from her brain, reported The Guardian.\nA scan revealed that a motile helminth - a parasitic roundworm - was living in the right frontal lobe lesion of her brain.\n“Oh my god, you wouldn’t believe what I just found in this lady’s brain – and it’s alive and wriggling,” the neurosurgeon told a colleague.\nHuman germs could kill aliensHumans could wipe out aliens by taking our germs into space, said the Daily Star.\nFrank Bolger of Wildwood was collecting litter on a New Jersey beach when he found the message in a bottle.",
        "source": "https://www.theweek.co.uk/news/962186/wriggling-worm-in-womans-brain"
    },
    {
        "title": "‘Like an alien world’: the banks of the River Thames and beyond – in pictures",
        "publish_time": "2023-08-29 00:00:00",
        "summary": "Fisherman on the Thames, 2014‘Taken during my commute to work.\nI would either have a 20-minute bus ride or an hour-long walk and I’d always take the walk.\nIn 10 years I’ve never seen anything like this scene, and the fisherman gazing into the Thames adds some nice scale.\nI sometimes think it looks a bit like an alien world.’ 10 Miles West by Josh Edgoose is published by Setanta Books .\nAll photographs: Josh Edgoose",
        "source": "https://www.theguardian.com/artanddesign/gallery/2023/aug/29/like-an-alien-world-the-banks-of-the-river-thames-and-beyond-in-pictures"
    },
    {
        "title": "Burning Trees for Energy is Not a Climate Solution",
        "publish_time": "2023-08-29 00:00:00",
        "summary": "But the advancing climate catastrophe has freaked out scientists.\nUS) of another terrified contingent, children, whose future is being destroyed, with the assertion that there is “no Constitutional guarantee to a stable climate system”.\nNow, armed with that argument, plus the attraction of a cheap subsidized alternative to meet their carbon-neutrality commitments, governments are engaging the biomass industry to assault the world’s forests.\nUnique among “clean energy” alternatives forest biomass combustion actually increases global warming, since it shrinks its own generator.\nAs fuel, biomass releases 1 ½ times more greenhouse gas than coal per unit energy, and many times greater particulate pollution.",
        "source": "https://www.counterpunch.org/2023/08/29/burning-trees-for-energy-is-not-a-climate-solution/"
    },
    {
        "title": "“Alien” Series Adds Kit Young, Halts Shoot",
        "publish_time": "2023-08-29 05:48:10",
        "summary": "Kit Young (“Shadow and Bone”) is reportedly a late addition to the cast of Noah Hawley’s “Alien” prequel TV series at FX.\nThe series started filming in Thailand in mid-July, but without Chandler, who is a SAG-AFTRA member.\nCrew members and set construction will continue in readiness for when shooting resumes after the actor’s strike ends.\nHawley created the series set well before Sigourney Weaver’s Ellen Ripley.\nRidley Scott executive produces the series, which has booked out most of the sound stages in Bangkok.",
        "source": "https://www.darkhorizons.com/alien-series-adds-kit-young-halts-shoot/"
    },
    {
        "title": "‘Alien’: Kit Young Added To Cast; FX Series Halts Filming Amid SAG-AFTRA Strike",
        "publish_time": "",
        "summary": "EXCLUSIVE: Shadow and Bone star Kit Young is part of the Season 1 cast of FX’s Alien series, sources tell Deadline.\nAdditionally, I hear filming in Thailand has been suspended due to the ongoing SAG-AFTRA strike, and the cast was sent home Friday.\nAccording to sources, the break was planned as the show’s production schedule was adjusted to account for the SAG-AFTRA work stoppage.\nCrew members are still working, and sets are still being prepared for when shooting resumes after the end of the strike, sources said.\nYoung plays a character named Tootles in Noah Hawley’s prequel to the Alien franchise, I hear.",
        "source": "https://ca.news.yahoo.com/alien-kit-young-added-cast-022250216.html"
    }
]