[
    {
        "title": "100% Dividend: Small Cap Healthcare Stock Fixes Record Date For 100% Payout, Stock Jumps 1.05%",
        "publish_time": "2023-08-28 21:08:16",
        "summary": "100% Dividend: Small Cap Healthcare Stock Fixes Record Date For 100% Payout, Stock Jumps 1.05% Investment oi-Shubham KumarSmall-cap Healthcare company Vijaya Diagnostic Centre Ltd. on Monday in an exchange filing announced the record date for the dividend for the financial year 2022-23.\nThe Board has fixed Wednesday, Sept 13, 2023, as the record date for Re 1 per equity share (@100%) of the face value of Re 1 each for the financial year ended March 31, 2023.\"\nAccording to an exchange filing on May 29, 2023, by the company, \"Recommendation of dividend of Re.\n1/- per equity share (@100% on a face value of Re.\nThe AGM date and record date for the purpose of the payment of dividend will be announced in due course.\"",
        "source": "https://www.goodreturns.in/personal-finance/investment/100-dividend-small-cap-healthcare-stock-fixes-record-date-for-100-payout-stock-jumps-1-05-1296975.html"
    },
    {
        "title": "Reliance AGM 2023: Analysts Expect Stock To Fall But Still Find Value",
        "publish_time": "",
        "summary": "Reliance Industries Ltd. may be undervalued even as the stock is likely to decline after the annual general meeting, according to analysts.\n\"This may be the reason behind the fall in stock prices tomorrow,\" he said.\nMayuresh Joshi, head of research at William O'Neil, said that the stock may witness a negative tick tomorrow based on the market's \"sentiment\".\nThe investors were looking forward to hearing about the strategy, plan, and business model of Jio Financial Services.\nBora advised investors to buy the stock \"on any dip\", as the company continues to grow its oil-to-chemicals business and for its long-term value creation in Jio Financial Services.",
        "source": "https://www.bqprime.com/markets/reliance-agm-2023-valuation-and-expectations-from-the-stock-according-to-analysts"
    },
    {
        "title": "Multibagger Small Cap Stock Jumps On Securing Order Worth Rs 15 Million, Launches 5 New Products",
        "publish_time": "2023-08-28 21:05:10",
        "summary": "Multibagger Small Cap Stock Jumps On Securing Order Worth Rs 15 Million, Launches 5 New Products Business oi-Shubham KumarSprayking Agro Equipment Limited, a brass manufacturer, on Monday, announces that the company has received repeat purchase order worth Rs 15 millions for the supply of Brass parts.\nFurthermore, the Company stated in the filing that it is in advance talks with Lixil Group ~ South Africa for future business order.\nOn Monday, following the order announcement Sprayking Agro Equipment shares rallied 1.04%, touched the upper circuit at Rs 202.65 on BSE.\nIts 52-week high is Rs 209.95 per share and 52-week low is Rs 13.56 per share on BSE.\nAbout - Sprayking Agro Equipment LimitedFounded in early 1980, Sprayking Agro Equipment Limited is Indutrial sector company engaged Brass Parts manufacturing, including Brass Fittings, Brass Forging Equipment, Brass Transformer Parts & other Customized Brass Parts.",
        "source": "https://www.goodreturns.in/news/multibagger-small-cap-stock-jumps-on-securing-order-worth-rs-15-million-launches-5-new-products-1296971.html"
    },
    {
        "title": "Are you a robot?",
        "publish_time": "2023-08-27 00:00:00",
        "summary": "Why did this happen?\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading.\nFor more information you can review our Terms of Service and Cookie Policy.",
        "source": "https://www.bloomberg.com/news/articles/2023-08-27/asia-stocks-set-for-small-gains-currencies-steady-markets-wrap"
    },
    {
        "title": "Heavy Buying: Multibagger auto stock hits back-to-back 52-week highs after Vijay Kedia buys 4,30,000 shares and Societe Generale bought 1,41,190 shares!",
        "publish_time": "",
        "summary": "Heavy Buying: Multibagger auto stock hits back-to-back 52-week highs after Vijay Kedia buys 4,30,000 shares and Societe Generale bought 1,41,190 shares!\nRecently the stock is hitting back-to-back 52-week highs because Societe Generale bought 141,190 shares of the company, representing a 0.5 per cent stake on August 23, 2023.\nIncluding the shares purchased by Kedia Securities, Vijay Kedia's current stake in the company is 2.93 per cent.\nThe multibagger auto stock that you are interested in is ATUL AUTO LIMITED.\nHowever, it incurred an operating loss of Rs 4.25 crore and a net loss of Rs 9.41 crore.",
        "source": "https://www.dsij.in/dsijarticledetail/heavy-buying-multibagger-auto-stock-hits-back-to-back-52-week-highs-after-vijay-kedia-buys-430000-shares-and-societe-generale-bought-141190-shares-32856-2"
    },
    {
        "title": "Google Help",
        "publish_time": "",
        "summary": "If you're having trouble accessing a Google product, there's a chance we're currently experiencing a temporary problem.\nYou can check for outages and downtime on the G Suite Status Dashboard",
        "source": "https://support.google.com/websearch%3Fp%3Dws_settings_location%26hl%3Den-IN"
    }
]